In [1]:
import numpy as np
import pandas as pd

### Get statistics for each group (such as count, mean, etc) using groupby
[source](https://stackoverflow.com/questions/19384532/get-statistics-for-each-group-such-as-count-mean-etc-using-pandas-groupby)

In [2]:
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
df

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [3]:
df.groupby(['A', 'B']).size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [4]:
df.groupby(['A', 'B']).size().reset_index(name='counts')

     A      B  counts
0  bar    one       1
1  bar  three       1
2  bar    two       1
3  foo    one       2
4  foo  three       1
5  foo    two       2

In [5]:
#  to calculate statistics on grouped data
(df
 .groupby(['A', 'B'])
 .agg({
     'C': ['mean', 'count'],
     'D': ['median', 'min', 'count']
 }))

             C            D
          mean count median min count
A   B
bar one      1     1      2   2     1
    three    3     1      6   6     1
    two      5     1     10  10     1
foo one      3     2      6   0     2
    three    7     1     14  14     1
    two      3     2      6   4     2

### convert index of a pandas dataframe into a column
[source](https://stackoverflow.com/questions/20461165/how-to-convert-index-of-a-pandas-dataframe-into-a-column)

In [6]:
df = pd.DataFrame([{'c1':10, 'c2':100}, {'c1':11,'c2':110}, {'c1':12,'c2':120}])
df

   c1   c2
0  10  100
1  11  110
2  12  120

In [7]:
# approach 1
df['index1'] = df.index
df

   c1   c2  index1
0  10  100       0
1  11  110       1
2  12  120       2

In [8]:
# approach 2
df.reset_index(level=0, inplace=True)
df

   index  c1   c2  index1
0      0  10  100       0
1      1  11  110       1
2      2  12  120       2